throughput_tests/results_multihilo_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        20225 bytes

Concurrency Level:      50
Time taken for tests:   0.064 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      20269000 bytes
HTML transferred:       20225000 bytes
Requests per second:    15517.59 [#/sec] (mean)
Time per request:       3.222 [ms] (mean)
Time per request:       0.064 [ms] (mean, across all concurrent requests)
Transfer rate:          307154.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:     0    2   0.6      2       6
Waiting:        0    1   0.5      1       5
Total:          1    3   0.7      3       7

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      4
  95%      4
  98%      5
  99%      5
 100%      7 (longest request)