throughput_tests/results_multihilo_500.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        20225 bytes

Concurrency Level:      500
Time taken for tests:   0.080 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      20269000 bytes
HTML transferred:       20225000 bytes
Requests per second:    12526.31 [#/sec] (mean)
Time per request:       39.916 [ms] (mean)
Time per request:       0.080 [ms] (mean, across all concurrent requests)
Transfer rate:          247945.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   16   3.3     15      23
Processing:     7   20   5.2     20      39
Waiting:        0   11   4.7     11      23
Total:         15   35   3.8     35      54

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     35
  75%     36
  80%     37
  90%     39
  95%     39
  98%     40
  99%     53
 100%     54 (longest request)