throughput_tests/results_multihilo_5000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        19725 bytes

Concurrency Level:      5000
Time taken for tests:   0.461 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      98845000 bytes
HTML transferred:       98625000 bytes
Requests per second:    10845.09 [#/sec] (mean)
Time per request:       461.038 [ms] (mean)
Time per request:       0.092 [ms] (mean, across all concurrent requests)
Transfer rate:          209371.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   33  37.1     12      92
Processing:    13   70  21.5     68     138
Waiting:        0   57  28.4     56     138
Total:         46  103  50.2     73     219

Percentage of the requests served within a certain time (ms)
  50%     73
  66%     79
  75%    155
  80%    167
  90%    184
  95%    200
  98%    207
  99%    210
 100%    219 (longest request)